"""
Напишите программу, которая будет считывать содержимое файла, добавлять к считанным строкам порядковый номер и сохранять их в таком
виде в новом файле. Имя исходного файла необходимо запросить у пользователя, так же, как и имя целевого файла. Каждая строка в созданном
файле должна начинаться с ее номера, двоеточия и пробела, после чего должен идти текст строки из исходного файла.
"""
output = input("Введите имя целевого файла: ")

with open("FileforTask3.txt", "r") as f2, open(f'{output}.txt', "w") as f_output:
    for i, line in enumerate(f2):
        f_output.write(f"{i+1}: {line}")
