"""
Напишите функцию cacluate, которая может принимать любое количество чисел и возвращать кортеж.

Первое значение кортежа - это среднее значение всех параметров, а второе значение - все числа, превышающие среднее значение.
Второе значение оформите в виде списка.
"""
def calculate(*args):
    avg = sum(args) / len(args)
    above_avg = [num for num in args if num > avg]
    return (avg, above_avg)
print(calculate(2,8,6,1))