"""
Представьте, что сумма за пользование услугами такси складывается из
базового тарифа в размере $4,00 плюс $0,25 за каждые 140 м поездки.
Напишите функцию, принимающую в качестве единственного параметра
расстояние поездки в километрах и возвращающую итоговую сумму опла-
ты такси.
"""
def taxi_fare(distance_km):
    distance_m = distance_km * 1000
    tariff_units = distance_m / 140
    total_fare = 4 + 0.25 * tariff_units
    return total_fare

print(round((taxi_fare(5)), 2))
