"""
Напишите программу печатающую бейджики учеников.
Программа запрашивает ввод числа учеников и печатает каждому бейджик. Бейдж содержит название учебного заведения:
«Колледж Сириус», поле для имени:
«Имя: ____» и поле для школы:
«Группа: ____». Напиши программу, печатающую бейджики студентов как на картинке. В завершении программа должна печатать:
«Готово! Заберите бейджики.»
Функция должна принимать имя и группу ученика.
"""
def print_stud():
    print('Колледж Сириус')
    print('Имя:___')
    print('Школа:___')
    print('Группа:___')

print('Автомат для печати бейджиков')
amount = int(input('число учеников:'))
for i in range (amount):
    print_stud()
    print('Готово! Заберите бейджики.')