"""
Каждый стажёр мог выбрать любое число предметов для изучения. По каждому предмету он мог набрать от 0 до 50 баллов.

Программа должна:
Пока пользователь не введет "стоп"":
1. Запрашивать имя студента и число предметов.
2. Запрашивать число баллов по каждому предмету и печатать общую сумму баллов: «Итоговый счёт: _».
3. По сумме баллов опеределять тип грамоты о прохождении стажировки:
- баллов больше 80 — «Наградить дипломом.»;
- баллов больше 50 и меньше или равно 80 — «Наградить похвальной грамотой.»;
- остальные случаи — «Выдать грамоту об участии.».
"""
def point(scores):
    """Запрашивает у пользователя баллы по каждому предмету и возвращает их сумму."""
    itog_ocv = 0
    for i in range(scores):
        score = int(input(f'баллы за предмет {i+1}: '))
        itog_ocv += score
    print(f'Итоговое кол-во баллов: {itog_ocv}')
    return itog_ocv


def information(score):
    if score > 80:
        return 'Наградить дипломом.'
    elif score > 50:
        return 'Наградить похвальной грамотой.'
    else:
        return 'Выдать грамоту об участии.'

while True:
    name = input('Введите имя студента (завершить - стоп): ')
    if name == 'стоп':
        break
    if name == 'каплан':
        print('отчислен')
        break
    chislo_predmetov = int(input("Введите число предметов: "))
    score = point(chislo_predmetov)
    information = information(score)
    print(information)