"""
Напишите программу-имитатор подбрасывания 2 кубиков.
Программа выводит на экран "подбрасываю кубики" и спустя 2 секунды выводит значения на кубиках в одну строку.
"""
from time import sleep
from random import randint

print("Подбрасываю кубики...")
sleep(2)
kubik1 = randint(1, 6)
kubik2 = randint(1, 6)
print("На кубиках выпало:", kubik1, kubik2)