"""
В каждом заплыве участвуют два случайных спортсмена из разных сборных. Напиши программу для печати номеров спортсменов.

1) Программа должна запрашивать количество спортсменов в каждой сборной с сообщением: «Число участников сборной _:».
2) Затем должна печататься пара случайных спортсменов из разных сборных для заплыва в формате: «Пловец _ - пловец _».
"""
from random import randint

n1 = int(input("Число участников сборной 1: "))
n2 = int(input("Число участников сборной 2: "))

for i in range(1):
    swimmer1 = randint(1,n1)
    swimmer2 = randint(1,n2)
    print("Пловец", swimmer1, "-", "Пловец", swimmer2)
