"""
Напишите программу-имитатор подбрасывания 2 кубиков.
Программа выводит на экран "подбрасываю кубики" и спустя 2 секунды выводит значения на кубиках в одну строку.
"""
import time
import random

print("Подбрасываю кубики...")
time.sleep(2)
kubik1 = random.randint(1, 6)
kubik2 = random.randint(1, 6)
print("На кубиках выпало:", kubik1, kubik2)