"""
На летней универсиаде будет проводиться по два забега. Чтобы соревнования были честными,
участники должны распределяться между забегами случайным образом.
Напишите программу, печатающую случайные номера забегов (1 или 2) до тех пор, пока не будет введено «off».
После генерации каждого номера должно печататься:
1) «Ваш номер: _».
2) «Участников в первом забеге: _», «Участников во втором забеге: _».
"""
import random
num1 = 0
num2 = 0
while True:
    choice = input("Введите 'off', чтобы выйти: ")
    if choice == "off":
        break
    else:
        num = random.randint(1, 2)
        print("Ваш номер:", num)
        if num == 1:
            num1 += 1
        else:
            num2 += 1
        print("Участников в первом забеге:", num1)
        print("Участников во втором забеге:", num2)