"""
Напишите программу, которая запрашивает ввод двух значений.
Если хотя бы одно из них не является числом, то должна выполняться конкатенация, то есть соединение, строк.
В остальных случаях введенные числа суммируются.
"""
a = input("Введите первое значение: ")
b = input("Введите второе значение: ")
if a.isnumeric() and b.isnumeric():
    result = int(a) + int(b)
else:
    result = a + b
print(result)
