"""
Напишите программу которая будет спрашивать пользователя ввод имени пока пользователь не введет off.
Программа должна используя lambda-функцию добавлять к каждому имени надпись "гений".
"""
while True:
    name = input("Введите имя (off - выход): ")
    if name == "off":
        break
    print((lambda x: x + " гений")(name))